const dummyDangerZones = [
  {
      id: "DZ_001",
      type: "불법소각 민원",          // 위험 종류
      lat: 37.2164851600941,        // 위도 
      lng: 126.934789483585,        // 경도
      dangerLevel: "위험도 높음",     // 위험도 (높음, 중간, 낮음)
      address: "경기 화성시 효행구 봉담읍 상리 383-2",
      description: "최근 24시간 소각 민원 2회 발생"
  },
  {
      id: "DZ_002",
      type: "건조 경보 지역",
      lat: 37.2172364753542,
      lng: 127.00460015885409,
      dangerLevel: "위험도 중간",
      address: "경기 화성시 병점구 송산동 184-12",
      description: "건조 경보 지역"
  },
  {
    id: "DZ_003",
    type: "산불 위험 구역",
    lat: 37.2140726845749,
    lng: 126.933003172514,
    dangerLevel: "위험도 낮음",
    address: "경기도 화성시 효행구 봉담읍 상리 산82",
    description: "산불 주의 구역"
  },
  {
    id: "DZ_004",
    type: "흡연 민원 구역",
    lat: 37.228280924760135,
    lng: 126.96809956259591,
    dangerLevel: "위험도 낮음",
    address: "경기 화성시 동탄·병점 인접 산림",
    description: "건조 경보 지역"
  },
  {
    id: "DZ_005",
    type: "논밭두렁 소각 민원 구역",
    lat: 37.20708885764981,
    lng: 126.97045162691263,
    dangerLevel: "위험도 중간",
    address: "경기 화성시 동탄·병점 인접 산림",
    description: "산불 주의 구역"
  },
];

  // 순찰 동선 경유지
  // DZ_001 → SO_001 ~ SO_017 → DZ_003
  const dummyWaypoints = [
    { id: "SO_001", label: "경유지 1",  lat: 37.21601728862465, lng: 126.93437866153921 },
    { id: "SO_002", label: "경유지 2",  lat: 37.21591819196502, lng: 126.93441254662105 },
    { id: "SO_003", label: "경유지 3",  lat: 37.21580110547771, lng: 126.9345027791767 },
    { id: "SO_004", label: "경유지 4",  lat: 37.21571111099343, lng: 126.93470283532871 },
    { id: "SO_005", label: "경유지 5",  lat: 37.21562332077387, lng: 126.93481557472073 },
    { id: "SO_006", label: "경유지 6",  lat: 37.21550621849085, lng: 126.93487764042641 },
    { id: "SO_007", label: "경유지 7",  lat: 37.215398125115776,lng: 126.93493688161901 },
    { id: "SO_008", label: "경유지 8",  lat: 37.215303448382166,lng: 126.93481584992408 },
    { id: "SO_009", label: "경유지 9",  lat: 37.215215448551945,lng: 126.9345483507159 },
    { id: "SO_010", label: "경유지 10", lat: 37.215213105548706,lng: 126.93438499121609 },
    { id: "SO_011", label: "경유지 11", lat: 37.21509999543671, lng: 126.93352603416821 },
    { id: "SO_012", label: "경유지 12", lat: 37.21501653600688, lng: 126.93332613087449 },
    { id: "SO_013", label: "경유지 13", lat: 37.214951141717705,lng: 126.933205075987 },
    { id: "SO_014", label: "경유지 14", lat: 37.21484746703733, lng: 126.93310940419684 },
    { id: "SO_015", label: "경유지 15", lat: 37.21473027654208, lng: 126.93301374461782},
    { id: "SO_016", label: "경유지 16", lat: 37.214581558818765,lng: 126.93293501257482},
    { id: "SO_017", label: "경유지 17", lat: 37.21449365067692, lng:126.93283651109338}
  ];
  
  // 감시원 위치·상태
  const dummyUsers = [
    {
      id: "USER_001",
      name: "정승우",
      isMain: true,              // 본인
      lat: 37.1995,              // GPS로 덮어씀
      lng: 126.8312,
      status: "PATROLLING",      // 순찰중
    },
    {
      id: "USER_002",
      name: "이다영",
      isMain: false,
      lat: 37.22006682467144,
      lng: 126.94954170852772,
      status: "PATROLLING"       // 순찰중
    },
    {
      id: "USER_003",
      name: "양정빈",
      isMain: false,
      lat: 37.224391702598055,
      lng: 126.98467595639282,
      status: "WAITING"          // 대기중
    },
    {
      id: "USER_004",
      name: "상범",
      isMain: false,
      lat: 37.22727069835462,
      lng: 126.96440404905255,
      status: "WAITING"          // 대기중 (파란 마커)
    },
    {
      id: "USER_005",
      name: "서현",
      isMain: false,
      lat: 37.2112695264446,
      lng: 126.96963886440886,
      status: "PATROLLING"       // 순찰중 (회색 마커)
    }
  ];
